Enums/ВидыОсобыхНачисленийИУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОсобыхНачисленийИУдержаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДивидендыСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорАвторскогоЗаказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорРаботыУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДСВРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияЗаЗадержкуЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальнаяВыгодаПоЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМатериальнаяПомощь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачисленоПроцентовПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛДоначисленныйПоРезультатамПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛЗачтено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛКЗачету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛПередачаЗадолженностиВНалоговыйОрган</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛПрочиеРасчетыСПерсоналом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛСПревышения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НФДЛДивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НФДЛДивидендыСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЗаймаИзЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриРожденииРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентыПоЗайму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьПодарковПризов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаПогребение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеНаПогребениеСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДивиденды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИПНДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМСДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыСубъектаПредпринимательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОДоходыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОРасчетыСБывшимиСотрудниками</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоходовИсполнительногоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыДоходовИсполнительногоПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоходыБезОграниченияВзысканий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаВознаграждения</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацииНеоблагаемые</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацииОблагаемые</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацииНеоблагаемыеПериодические</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацииОблагаемыеПериодические</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацииНеоблагаемыеЕдиновременные</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацииОблагаемыеЕдиновременные</Name>
					<Comment>АПК:58 различия имени и синонима оправданы длиной</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОсобыхНачисленийИУдержаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает виды доходов исполнительного производства начислений
// Параметры:
//	Период - дата, на которую необходимо получить виды доходов исполнительного производства.
//
// Возвращаемое значение:
// 	Соответствие:
// 	 	* Ключ     - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний
// 	 	* Значение - ПеречислениеСсылка.ВидыДоходовИсполнительногоПроизводства
// 
Функция ВидыДоходовИсполнительногоПроизводства(Период) Экспорт

	ВидыДоходовИсполнительногоПроизводства = Новый Соответствие;
	
	ВидыДоходов = Перечисления.ВидыДоходовИсполнительногоПроизводства;
	ВидыДоходовИсполнительногоПроизводства.Вставить(Дивиденды,            ВидыДоходов.ДоходыБезОграниченияВзысканий);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДивидендыСотрудников, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	
    // ЗУПК
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДоговорАвторскогоЗаказа, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДоговорРаботыУслуги,     ВидыДоходов.ДоходыБезОграниченияВзысканий);
	
	ВидыДоходовИсполнительногоПроизводства.Вставить(КомпенсацияЗаЗадержкуЗарплаты, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	
	// МатериальнаяВыгодаПоЗаймам не является доходом вообще, в том смысле, 
	// что ИЛ с ее сумм не должны начисляться, и ее НДФЛ можно регистрировать как угодно.
	// Призы проходят в "Перечне видов заработной платы и иного дохода, из которых производится удержание алиментов"
	// в пункте "м) с других видов выплат к заработной плате, установленных законодательством..."
	// Поэтому относим эти виды особых начислений и удержаний к "зарплатным" доходам.
	ВидыДоходовИсполнительногоПроизводства.Вставить(МатериальнаяВыгодаПоЗаймам, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	ВидыДоходовИсполнительногоПроизводства.Вставить(СтоимостьПодарковПризов,    ВидыДоходов.ДоходыБезОграниченияВзысканий);
	Если ВидыДоходовИсполнительногоПроизводствавызовСервера.ВступилиВСилуИзменения353ФЗ(Период) Тогда
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности, ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриРожденииРебенка,     ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребение,           ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребениеСотруднику, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	Иначе
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности, ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриРожденииРебенка,     ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребение,           ВидыДоходов.ДоходыБезОграниченияВзысканий);
		ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребениеСотруднику, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	КонецЕсли;
    // ЗУПК
	
	Возврат ВидыДоходовИсполнительногоПроизводства
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ОтключенныйФункционалЗарплатаКадры") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;

	СписокИсключаемыхЗначение = Новый СписокЗначений;
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ДСВРаботодателя);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.МатериальнаяВыгодаПоЗаймам);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛ);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛДоначисленныйПоРезультатамПроверки);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛДоходыКонтрагентов);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛЗачтено);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛКЗачету);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛПередачаЗадолженностиВНалоговыйОрган);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛПрочиеРасчетыСПерсоналом);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛРасчетыСБывшимиСотрудниками);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НФДЛДивиденды);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НФДЛДивидендыСотрудникам);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.НДФЛСПревышения);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ПособиеНаПогребение);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.ПособиеПриРожденииРебенка);
	СписокИсключаемыхЗначение.Добавить(Перечисления.ВидыОсобыхНачисленийИУдержаний.УдалитьМатериальнаяПомощь);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Индекс = 0 по Перечисления.ВидыОсобыхНачисленийИУдержаний.Количество()-1 Цикл
		ТекущееЗначение = Перечисления.ВидыОсобыхНачисленийИУдержаний.Получить(Индекс);
		Если СписокИсключаемыхЗначение.НайтиПоЗначению(ТекущееЗначение) = Неопределено Тогда
			ДанныеВыбора.Добавить(ТекущееЗначение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
